In [10]:
import pandas as pd

In [11]:
df = pd.read_csv('https://raw.githubusercontent.com/balaji2v/Inceptez_Batch19/main/company.csv')

In [14]:
df.head()

   Company   Age  Salary     Place Country
0      TCS  20.0     NaN   Chennai   India
1  Infosys  30.0     NaN    Mumbai   India
2      TCS  35.0  2300.0  Calcutta   India
3  Infosys  40.0  3000.0     Delhi   India
4      TCS  23.0  4000.0    Mumbai   India

In [47]:
#dim of data
df.size
df.shape

(124, 5)

In [16]:
lst=list(df)
lst

['Company', 'Age', 'Salary', 'Place', 'Country']

In [17]:
#top 10 rows
df.head(10)

   Company   Age  Salary     Place Country
0      TCS  20.0     NaN   Chennai   India
1  Infosys  30.0     NaN    Mumbai   India
2      TCS  35.0  2300.0  Calcutta   India
3  Infosys  40.0  3000.0     Delhi   India
4      TCS  23.0  4000.0    Mumbai   India
5  Infosys   NaN  5000.0  Calcutta   India
6      TCS   NaN  6000.0   Chennai   India
7  Infosys  23.0  7000.0    Mumbai   India
8      TCS  34.0  8000.0  Calcutta   India
9      CTS  45.0  9000.0     Delhi   India

In [18]:
#List the last 15 rows in datframe
df.tail(15)

                       Company   Age  Salary      Place Country
134  Tata Consultancy Services  31.0  8345.0     Mumbai   India
135                        CTS  40.0  9284.0   Calcutta   India
136                        NaN   NaN     NaN      Delhi   India
137                        CTS  31.0  2034.0     Mumbai   India
138                        CTS  44.0  3033.0     Cochin   India
139                 Congnizant  22.0  2934.0      Noida   India
140                    Infosys  44.0  4034.0  Hyderabad   India
141                        TCS  33.0  5034.0   Calcutta   India
142            Infosys Pvt Lmt  22.0  8202.0     Mumbai   India
143                        TCS  33.0  9024.0   Calcutta   India
144                    Infosys  22.0  8787.0   Calcutta   India
145                    Infosys  44.0  4034.0      Delhi   India
146                        TCS  33.0  5034.0     Mumbai   India
147                    Infosys  22.0  8202.0     Cochin   India
148                        NaN   NaN     NaN        NaN     NaN

In [19]:
#Find the number of rows in dataframe
df.shape

(149, 5)

In [20]:
#Check the information of dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  140 non-null    object
 1   Age      130 non-null    float64
 2   Salary   124 non-null    float64
 3   Place    134 non-null    object
 4   Country  148 non-null    object
dtypes: float64(2), object(3)
memory usage: 5.9+ KB

In [21]:
#Check the basic Statistics of Dataframe. Give your inference from the stats
df.describe()

              Age       Salary
count  130.000000   124.000000
mean    30.484615  5312.467742
std     11.096640  2573.764683
min      0.000000  1089.000000
25%     22.000000  3030.000000
50%     32.500000  5000.000000
75%     37.750000  8000.000000
max     54.000000  9876.000000

In [22]:
#Retrieve 20 to 100 rows and Company and age usig iloc
df.iloc[20:101,:2]

     Company   Age
20       TCS  37.0
21   Infosys  50.0
22       TCS  21.0
23   Infosys   NaN
24       TCS   NaN
..       ...   ...
96       TCS   NaN
97   Infosys  22.0
98       TCS  33.0
99       CTS  44.0
100      CTS  22.0

[81 rows x 2 columns]

In [23]:
#Retrieve 20 to 100 rows and Company and age usig loc
df.loc[20:100,['Company','Age']]

     Company   Age
20       TCS  37.0
21   Infosys  50.0
22       TCS  21.0
23   Infosys   NaN
24       TCS   NaN
..       ...   ...
96       TCS   NaN
97   Infosys  22.0
98       TCS  33.0
99       CTS  44.0
100      CTS  22.0

[81 rows x 2 columns]

In [24]:
#Chage the data in 100 row and Place as 'Noida'
df.at[100,'Place']='Noida'
display(df.iloc[100])

Company      CTS
Age         22.0
Salary       NaN
Place      Noida
Country    India
Name: 100, dtype: object

In [25]:
#Change the column 'Place' to 'City'
df.rename(columns = {'Place':'City'}, inplace = True)
df.head()

   Company   Age  Salary      City Country
0      TCS  20.0     NaN   Chennai   India
1  Infosys  30.0     NaN    Mumbai   India
2      TCS  35.0  2300.0  Calcutta   India
3  Infosys  40.0  3000.0     Delhi   India
4      TCS  23.0  4000.0    Mumbai   India

In [26]:
#List down the unique data in each columns and find length of unique data
for i in df.columns:
    print(df[i].unique())

['TCS' 'Infosys' 'CTS' nan 'Tata Consultancy Services' 'Congnizant'
 'Infosys Pvt Lmt']
[20. 30. 35. 40. 23. nan 34. 45. 18. 22. 32. 37. 50. 21. 46. 36. 26. 41.
 24. 25. 43. 19. 38. 51. 31. 44. 33. 17.  0. 54.]
[  nan 2300. 3000. 4000. 5000. 6000. 7000. 8000. 9000. 1089. 1234. 3030.
 3045. 3184. 4824. 5835. 7084. 8943. 8345. 9284. 9876. 2034. 7654. 2934.
 4034. 5034. 8202. 9024. 4345. 6544. 6543. 3234. 4324. 5435. 5555. 8787.
 3454. 5654. 5009. 5098. 3033.]
['Chennai' 'Mumbai' 'Calcutta' 'Delhi' 'Podicherry' 'Cochin' nan 'Noida'
 'Hyderabad' 'Bhopal' 'Nagpur' 'Pune']
['India' nan]

In [27]:
#Check how many duplicated data is there?
print(df.duplicated().sum())

8

In [28]:
#Remove all duplicated rowise data
df.drop_duplicates()

             Company   Age  Salary       City Country
0                TCS  20.0     NaN    Chennai   India
1            Infosys  30.0     NaN     Mumbai   India
2                TCS  35.0  2300.0   Calcutta   India
3            Infosys  40.0  3000.0      Delhi   India
4                TCS  23.0  4000.0     Mumbai   India
..               ...   ...     ...        ...     ...
140          Infosys  44.0  4034.0  Hyderabad   India
141              TCS  33.0  5034.0   Calcutta   India
142  Infosys Pvt Lmt  22.0  8202.0     Mumbai   India
143              TCS  33.0  9024.0   Calcutta   India
148              NaN   NaN     NaN        NaN     NaN

[141 rows x 5 columns]

In [29]:
#Remove the column 'Country'
df.drop(['Country'], axis=1)
#df.head()

     Company   Age  Salary      City
0        TCS  20.0     NaN   Chennai
1    Infosys  30.0     NaN    Mumbai
2        TCS  35.0  2300.0  Calcutta
3    Infosys  40.0  3000.0     Delhi
4        TCS  23.0  4000.0    Mumbai
..       ...   ...     ...       ...
144  Infosys  22.0  8787.0  Calcutta
145  Infosys  44.0  4034.0     Delhi
146      TCS  33.0  5034.0    Mumbai
147  Infosys  22.0  8202.0    Cochin
148      NaN   NaN     NaN       NaN

[149 rows x 4 columns]

In [30]:
#Remove the row number 137
df.drop(137, axis=0)

     Company   Age  Salary      City Country
0        TCS  20.0     NaN   Chennai   India
1    Infosys  30.0     NaN    Mumbai   India
2        TCS  35.0  2300.0  Calcutta   India
3    Infosys  40.0  3000.0     Delhi   India
4        TCS  23.0  4000.0    Mumbai   India
..       ...   ...     ...       ...     ...
144  Infosys  22.0  8787.0  Calcutta   India
145  Infosys  44.0  4034.0     Delhi   India
146      TCS  33.0  5034.0    Mumbai   India
147  Infosys  22.0  8202.0    Cochin   India
148      NaN   NaN     NaN       NaN     NaN

[148 rows x 5 columns]

In [31]:
#Find number of each labels in Company
df.groupby('Company').size()

Company
CTS                          36
Congnizant                    2
Infosys                      45
Infosys Pvt Lmt               2
TCS                          53
Tata Consultancy Services     2
dtype: int64

In [32]:
#Find number of each labels in City
df.groupby('City').size()

City
Bhopal         1
Calcutta      33
Chennai       14
Cochin        12
Delhi         14
Hyderabad      8
Mumbai        37
Nagpur         1
Noida          9
Podicherry     3
Pune           2
dtype: int64

In [33]:
#Find Number of Null Values in each column
df.isnull().sum()

Company     9
Age        19
Salary     25
City       15
Country     1
dtype: int64

In [34]:
#Remove all Null values in Salary
df = df.dropna(subset=['Salary'])

In [35]:
#Replace the Null values in Comapany with mode
df['Company'].fillna(df['Company'].mode()[0])
print(df['Company'])

2          TCS
3      Infosys
4          TCS
5      Infosys
6          TCS
        ...
143        TCS
144    Infosys
145    Infosys
146        TCS
147    Infosys
Name: Company, Length: 124, dtype: object

In [39]:
#Replace the null value in age with mean
df['Age'].fillna(df['Age'].mean())

2      35.000000
3      40.000000
4      23.000000
5      30.280374
6      30.280374
         ...
143    33.000000
144    22.000000
145    44.000000
146    33.000000
147    22.000000
Name: Age, Length: 124, dtype: float64

In [57]:
df

     Company  Age  Salary      City Country
2        TCS  NaN  2300.0  Calcutta   India
3    Infosys  NaN  3000.0     Delhi   India
4        TCS  NaN  4000.0    Mumbai   India
5    Infosys  NaN  5000.0  Calcutta   India
6        TCS  NaN  6000.0   Chennai   India
..       ...  ...     ...       ...     ...
143      TCS  NaN  9024.0  Calcutta   India
144  Infosys  NaN  8787.0  Calcutta   India
145  Infosys  NaN  4034.0     Delhi   India
146      TCS  NaN  5034.0    Mumbai   India
147  Infosys  NaN  8202.0    Cochin   India

[124 rows x 5 columns]

In [40]:
#Filter the data with age>40 and Salary<5000
result = df.loc[(df['Age'] > 40) & df['Salary'] < 5000]
print(result)

     Company   Age  Salary      City Country
2        TCS  35.0  2300.0  Calcutta   India
3    Infosys  40.0  3000.0     Delhi   India
4        TCS  23.0  4000.0    Mumbai   India
5    Infosys   NaN  5000.0  Calcutta   India
6        TCS   NaN  6000.0   Chennai   India
..       ...   ...     ...       ...     ...
143      TCS  33.0  9024.0  Calcutta   India
144  Infosys  22.0  8787.0  Calcutta   India
145  Infosys  44.0  4034.0     Delhi   India
146      TCS  33.0  5034.0    Mumbai   India
147  Infosys  22.0  8202.0    Cochin   India

[124 rows x 5 columns]

In [ ]:
#Draw the pie chart for place and Company

In [41]:
#Find the mean age with repective to the Company
df.groupby('Company')['Age'].mean()

Company
CTS                          31.440000
Congnizant                   21.500000
Infosys                      32.636364
Infosys Pvt Lmt              21.500000
TCS                          28.923077
Tata Consultancy Services    33.500000
Name: Age, dtype: float64

In [42]:
#Find the mean, count, median of salary with repective to the place
df.groupby('City')['Salary'].median()

City
Bhopal        7000.0
Calcutta      4584.5
Chennai       6000.0
Cochin        5017.0
Delhi         3609.0
Hyderabad     3609.0
Mumbai        4824.0
Nagpur        8000.0
Noida         4000.0
Podicherry    3030.0
Pune          9000.0
Name: Salary, dtype: float64

In [43]:
df.groupby('City')['Salary'].mean()

City
Bhopal        7000.000000
Calcutta      5033.428571
Chennai       6115.090909
Cochin        5053.000000
Delhi         4768.833333
Hyderabad     4382.833333
Mumbai        4867.931034
Nagpur        8000.000000
Noida         4387.000000
Podicherry    4782.666667
Pune          9000.000000
Name: Salary, dtype: float64

In [44]:
df.groupby('City')['Salary'].count()

City
Bhopal         1
Calcutta      28
Chennai       11
Cochin        12
Delhi         12
Hyderabad      6
Mumbai        29
Nagpur         1
Noida          7
Podicherry     3
Pune           1
Name: Salary, dtype: int64